"use strict";

let MENU = [
  {
    id: 1,
    imgUrl: "../img/Rectangle 28.jpg",
    name: "Холодные закуски",
    menuDetail: [
      {
        id: 1,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 2,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 3,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 4,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 5,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 6,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 7,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 8,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 9,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 10,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
    ],
  },
  {
    id: 2,
    imgUrl: "../img/Rectangle 30.jpg",
    name: "Салаты",
    menuDetail: [
      {
        id: 1,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 2,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 3,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 4,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 5,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 6,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 7,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 8,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 9,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 10,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
    ],
  },
  {
    id: 3,
    imgUrl: "./img/gal3.jpg",
    name: "Выпечка",
    menuDetail: [
      {
        id: 1,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 2,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 3,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 4,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 5,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 6,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 7,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 8,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 9,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 10,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
    ],
  },
  {
    id: 4,
    imgUrl: "./img/gal4.jpg",
    name: "Супы",
    menuDetail: [
      {
        id: 1,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 2,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 3,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 4,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 5,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 6,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 7,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 8,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 9,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 10,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
    ],
  },
  {
    id: 5,
    imgUrl: "./img/gal7.jpg",
    name: "Блюда на мангале",
    menuDetail: [
      {
        id: 1,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 2,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 3,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 4,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 5,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 6,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 7,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 8,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 9,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 10,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
    ],
  },
  {
    id: 6,
    imgUrl: "./img/chakhokhbili-traditional-georgian-dish (1) 2.jpg",
    name: "Горячие блюда",
    menuDetail: [
      {
        id: 1,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 2,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 3,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 4,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 5,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 6,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 7,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 8,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 9,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 10,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
    ],
  },
  {
    id: 7,
    imgUrl: "./img/Rectangle 21.jpg",
    name: "Соусы",
    menuDetail: [
      {
        id: 1,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 2,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 3,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 4,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 5,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 6,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 7,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 8,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 9,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
      {
        id: 10,
        dishName: "Сациви из курицы",
        price: 390,
        weight: 200,
        energyValue: "320/16/27/4",
        composition:
          "кур. грудка 100г; орех грец. 60г; вода 20г; шафран 5г; уксус винный 1,5 ст.л.; масло слив. 2ст.л.; соль,перец по вкусу; хмели сунели 1ч.л.;чеснок 5г; лук репчатый 10г.",
      },
    ],
  },
];

//Global variable
let btnMenu = document.querySelector(".btn__mobile"),
  menuList = document.querySelector(".navigation__list"),
  modal = document.querySelector(".modal"),
  menuSliderContainer = document.querySelector(".menu__slider"),
  modalMenuEl = document.querySelector(".modal__menu"),
  closeBtn = document.querySelector(".btn__close");

let currentYear = new Date().getFullYear(),
  yearEl = document.querySelector(".year");
yearEl.innerText = currentYear;

drawItemSlider();

//Swiper
const swiper = new Swiper(".gallery__swiper", {
  slidesPerView: 4,
  spaceBetween: 2,
  grid: {
    rows: 2,
    fill: "row",
  },
  breakpoints: {
    1024: {
      slidesPerView: 4,
      grid: {
        rows: 2,
        fill: "row",
      },
    },
    740: {
      slidesPerView: 3,
      grid: {
        rows: 2,
        fill: "row",
      },
    },
    540: {
      slidesPerView: 2,
      grid: {
        rows: 2,
        fill: "row",
      },
    },
    375: {
      slidesPerView: 1,
      grid: {
        rows: 1,
        fill: "row",
      },
    },
  },
  pagination: {
    el: ".swiper-pagination",
    clickable: true,
    renderBullet: function (index, className) {
      return `<li class="swiper-pagination-bullet"></li>`;
    },
  },
});

Fancybox.bind("[data-fancybox=gallery]", {
  backFocus: false,
  buttons: ["fullScreen", "download", "thumbs", "close"],
  animationEffect: "zoom-in-out",
  animationDuration: 800,
  transitionEffect: "tube",
  transitionDuration: 1000,
  thumbs: false,
  hash: false,
  animationEffect: "fade",
  beforeClose: function (instance) {
    console.info(instance.currIndex);
    swiper.slideTo(instance.currIndex, 0);
  },
});

const swiperMenu = new Swiper(".menu__slider-wrapper", {
  slidesPerView: 4.5,
  loop: true,
  navigation: {
    nextEl: ".swiper-button-next",
    prevEl: ".swiper-button-prev",
  },
  spaceBetween: 2,
  breakpoints: {
    1440: {
      slidesPerView: 4.5,
    },
    1024: {
      slidesPerView: 4,
    },
    840: {
      slidesPerView: 3,
    },
    540: {
      slidesPerView: 2,
    },
  },
});

//Event listeners
btnMenu.addEventListener("click", mobileMenu);

window.onclick = function (event) {
  if (event.target == modal) {
    modal.style.display = "none";
  }
};

closeBtn.addEventListener("click", () => {
  modal.style.display = "none";
});

function mobileMenu() {
  btnMenu.classList.toggle("active");
  menuList.classList.toggle("navigation__list--active");
}

function drawItemSlider() {
  for (let i = 0; i < MENU.length; i++) {
    let itemEl = document.createElement("div"),
      imgEl = document.createElement("img"),
      titleEl = document.createElement("h3"),
      divEl = document.createElement("div"),
      btnEl = document.createElement("button");

    itemEl.classList.add("menu__slider-item", "swiper-slide");
    titleEl.classList.add("menu__title");
    divEl.classList.add("menu__overlay");
    btnEl.classList.add("btn", "btn__menu");
    btnEl.setAttribute("type", "button");
    btnEl.setAttribute("data-id", `${MENU[i].id}`);

    btnEl.innerText = "Открыть меню";

    imgEl.setAttribute("src", `${MENU[i].imgUrl}`);
    titleEl.innerText = MENU[i].name;

    divEl.append(btnEl);
    itemEl.append(imgEl, titleEl, divEl);
    menuSliderContainer.append(itemEl);
  }

  let menuBtn = document.querySelectorAll(".btn__menu");
  menuBtn.forEach((el) => {
    el.addEventListener("click", openMenu);
  });
}

function openMenu() {
  modal.style.display = "block";
  let id = parseInt(this.dataset.id);

  drawMenuDetail(id);
}

function drawMenuDetail(id) {
  let menuItem = MENU.find((item) => id === item.id);
  console.log(menuItem.menuDetail);

  let titleEl = document.querySelector(".title__modal");
  titleEl.innerText = menuItem.name;

  modalMenuEl.innerHTML = "";

  for (let i = 0; i < menuItem.menuDetail.length; i++) {
    let itemBlockHTML = `<div class="item__modal">
                            <div class="item__header">
                              <div class="item__title">${menuItem.menuDetail[i].dishName}</div>
                              <div class="item__price">${menuItem.menuDetail[i].price} грн</div>
                            </div>
                            <div class="item__info">
                              <span class="item__weight">${menuItem.menuDetail[i].weight} гр</span>
                              <span class="item__energy-value">КБЖУ: ${menuItem.menuDetail[i].energyValue}</span>
                            </div>
                            <div>
                              <p class="item__composition">${menuItem.menuDetail[i].composition}</p>
                            </div>
                          </div>`;

    modalMenuEl.innerHTML += itemBlockHTML;
  }
}
